UML/uml.org
#+TITLE: UML Distilled Brief Guide by Martin Fowler
#+AUTHOR: Ertale81
#+STARTDATE: <2025-03-02 Sun>

* What is UML?
- The Unified Modeling Language(UML) is a family of graphical notations that helps describing and designing software system, particularly software built using the object oriented(OO) style.
** Ways of using the UML
  1) *UML as sketch:*
     - *Forward engineering* draws a UML diagram before you wrote a code, while *reverse engineering* builds a UML diagram from existing code in order to help understand it.
     - The essence of sketching is selectivity. With *forward* sketching, you rough out some issues in code you are about to write. Your aim is to use the sketches to help communicate ideas and alternatives about what you are about to do. You don't talk about all the code you are going to work on, only important issues that you want to run past your colleagues first or sections of the design that you want to visualize before you begin programming.
     - With *reverse engineering*, you use sketches to explain how some parts of the system woks. You don't show every class, simply those that are interesting and worth talking about before you dig into the code.
     - The tools used for sketching are lightweight drawing tools, and often people aren't too particular about keeping to every strict rule of the UML.
     - In sketching the focus is communication rather than completeness.
  2) *UML as blueprint:*
     - UML as blueprint is about completeness.
     - *In forward engineering*, the idea is that blueprints are developed by a designer whose )ob is to build a detailed design for a programmer to code up. That design should be sufficiently complete in that all design decisions are laid out, and the programmer should be able to follow it as a pretty straightforward activity that requires little thought. The designer may be the same person as the programmer, but usually the designer is a more senior developer who designs for a team of programmers. The inspiration for this approach is other forms of engineering in which Professional engineers create engineering drawings that are handed over to construction companies to build.
     - A common approach is for a designer to develop blueprint-level models as far as interfaces of subsystems but then let developers work out the details of implementing those details.
     - *In reverse engineering*, blueprints aim to convey detailed information about the code either in paper documents or as an interactive graphical browser . The blueprints can show every detail about a class in a graphical form that's easier for developers to understand.
     - Blueprints require much more sophisticated tools than sketches do in order to handle the details required for the task . Specialized CASE (computer-aided software engineering) tools fall into this category.
     - Forward-engineering tools support diagram drawing and back it up with a repository to hold the information. Reverse-engineering tools read source code and interpret from it to the repository and generate diagrams. Tools that can do both forward and reverse engineering like this are referred to as a *round-trip* tools.
     - The line between blueprints and Sketches is somewhat blurry, but the distinction, I think, rests an the fact that sketches are deliberately incomplete, highlighting important information, while blueprints intend to be comprehensive, often with the aim of reducing programming to a simple and fairly mechanical activity. In a sound bite, I'd say that sketches are explorative, while blueprints are definitive.
     - As you do more and more in the UML and the programming gets increasingly mechanical, it becomes obvious that the programming should be automated. Indeed, many CASE tools do some form of code generation, which automates building a significant part of a system. Eventually, however, you reach the point at which all the System can be specified in the UML, and you reach UML as programming language.
  3) *UML as programming language:*
     - In this environment, developers draw UML diagrams that are compiled directly into executable code, the UML becomes the source code.Obviously, this usage of UML demands particularly sophisticated tooling . (Also, the notions of forward and reverse engineering don't make any sense for this mode, as the UML and source code are the same thing.)
     - 
