UML/uml.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-07 Sat 22:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>UML Distilled Brief Guide by Martin Fowler</title>
<meta name="author" content="Ertale81" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">UML Distilled Brief Guide by Martin Fowler</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga95998b">1. What is UML?</a>
<ul>
<li><a href="#org529b6d8">1.1. Ways of using the UML</a></li>
<li><a href="#org0ba5ea9">1.2. UML Diagrams</a></li>
</ul>
</li>
<li><a href="#org1baa36e">2. Development Process</a>
<ul>
<li><a href="#org5d44546">2.1. Iterative and Waterfall process</a></li>
<li><a href="#org765c480">2.2. Predictive and Adaptive planning</a></li>
<li><a href="#org1722479">2.3. Agile Processes</a></li>
<li><a href="#org97eb81c">2.4. Fitting a process into a project</a></li>
<li><a href="#org4339a9e">2.5. Fitting UML into a process</a>
<ul>
<li><a href="#orgaa80715">2.5.1. Requirement Analysis</a></li>
<li><a href="#org590377d">2.5.2. Design</a></li>
<li><a href="#org5616312">2.5.3. Documentation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org01a0441">3. Class Diagrams: The Essentials</a>
<ul>
<li><a href="#org2eb4b92">3.1. Property</a></li>
<li><a href="#org0483a44">3.2. Operations</a></li>
<li><a href="#org0232868">3.3. Notes and Comments</a></li>
<li><a href="#orgc1f2c08">3.4. Dependency</a></li>
<li><a href="#orge039b5b">3.5. Constraint Rules</a></li>
<li><a href="#org0b9828b">3.6. When to use Class diagrams?</a></li>
</ul>
</li>
<li><a href="#org3b28890">4. Sequence Diagrams</a>
<ul>
<li><a href="#org493db63">4.1. Creating and deleting Participants</a></li>
<li><a href="#orgdf7bc11">4.2. Loops, Conditionals, and the Like</a></li>
<li><a href="#org35defa8">4.3. Synchronous and Asynchronous Calls</a></li>
<li><a href="#org2035ab5">4.4. When to use Sequence diagrams?</a></li>
<li><a href="#orga5ed9dd">4.5. CRC Cards (Class-Responsibility-Collaboration Cards)</a></li>
</ul>
</li>
<li><a href="#org0baf369">5. Class diagrams: Advanced concepts</a>
<ul>
<li><a href="#org103bebd">5.1. Keywords</a></li>
<li><a href="#org4b09120">5.2. Static Operations and Attributes</a></li>
<li><a href="#org754f219">5.3. Aggregation and Composition</a></li>
<li><a href="#org78bfd4f">5.4. Derived Properties</a></li>
<li><a href="#orgeff3d62">5.5. Interfaces and Abstract Classes</a></li>
<li><a href="#orgeeda8ad">5.6. Read-Only and Frozen</a></li>
<li><a href="#org06a7aff">5.7. Reference Objects and Value Objects</a></li>
<li><a href="#org17980ef">5.8. Qualified Associations</a></li>
<li><a href="#org1992fd5">5.9. Classification and Generalization</a></li>
<li><a href="#org2c34499">5.10. Multiple and Dynamic Classification</a></li>
<li><a href="#org7029309">5.11. Association class</a></li>
<li><a href="#orgf277879">5.12. Template(Parameterized) class</a></li>
<li><a href="#org2495e9f">5.13. Enumerations</a></li>
<li><a href="#org54bf68a">5.14. Active class</a></li>
<li><a href="#org614a24a">5.15. visibility</a></li>
<li><a href="#org6205197">5.16. Messages</a></li>
</ul>
</li>
<li><a href="#org89e2d24">6. Object Diagrams</a>
<ul>
<li><a href="#org50b0d75">6.1. When to use Object diagrams?</a></li>
</ul>
</li>
<li><a href="#org8ff78f3">7. Package Diagrams</a>
<ul>
<li><a href="#org0f43ae0">7.1. Packages and Dependencies</a></li>
<li><a href="#org1ab26ac">7.2. When to use Package diagrams?</a></li>
</ul>
</li>
<li><a href="#org4932fb4">8. Deployment Diagram</a></li>
<li><a href="#org9b01b74">9. Use cases</a>
<ul>
<li><a href="#orgeb37073">9.1. Levels of Use Cases</a></li>
</ul>
</li>
<li><a href="#orgd6d218b">10. State Machine Diagram</a>
<ul>
<li><a href="#org85903d6">10.1. Internal Activities</a></li>
<li><a href="#org9a21551">10.2. Superstates</a></li>
<li><a href="#orgb96126e">10.3. Concurrent state</a></li>
<li><a href="#org8b4c714">10.4. Implementing State diagrams</a></li>
<li><a href="#org45baef2">10.5. When to use state diagrams?</a></li>
</ul>
</li>
<li><a href="#org234afc1">11. Activity Diagrams</a>
<ul>
<li><a href="#orgb77a90c">11.1. Decomposing actions</a></li>
<li><a href="#orgd4b464c">11.2. Partition</a></li>
<li><a href="#orgb573623">11.3. Signals</a></li>
<li><a href="#org0c244ae">11.4. Tokens</a></li>
<li><a href="#orge2209a0">11.5. Flows and Edges</a></li>
<li><a href="#orge4c4707">11.6. Pins and Transformations</a></li>
<li><a href="#org467c0ef">11.7. Expansion regions</a></li>
<li><a href="#org25368a1">11.8. Flow Final</a></li>
<li><a href="#org35bf71e">11.9. Join Specifications</a></li>
<li><a href="#orge09a493">11.10. When to use Activity diagram?</a></li>
</ul>
</li>
<li><a href="#org737c97f">12. Communication Diagrams</a>
<ul>
<li><a href="#org9c9274a">12.1. When to use communication diagrams?</a></li>
</ul>
</li>
<li><a href="#org11a13f9">13. Composite Structures</a>
<ul>
<li><a href="#org1c9df82">13.1. When to use composite structures?</a></li>
</ul>
</li>
<li><a href="#orgb9f729b">14. Component Diagrams</a></li>
<li><a href="#orgbdb6ffb">15. Timing Diagrams</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga95998b" class="outline-2">
<h2 id="orga95998b"><span class="section-number-2">1.</span> What is UML?</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The Unified Modeling Language(UML) is a family of graphical notations that helps describing and designing software system, particularly software built using the object oriented(OO) style.</li>
</ul>
</div>
<div id="outline-container-org529b6d8" class="outline-3">
<h3 id="org529b6d8"><span class="section-number-3">1.1.</span> Ways of using the UML</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><b>UML as sketch:</b>
<ul class="org-ul">
<li><b>Forward engineering</b> draws a UML diagram before you wrote a code, while <b>reverse engineering</b> builds a UML diagram from existing code in order to help understand it.</li>
<li>The essence of sketching is selectivity. With <b>forward</b> sketching, you rough out some issues in code you are about to write. Your aim is to use the sketches to help communicate ideas and alternatives about what you are about to do. You don't talk about all the code you are going to work on, only important issues that you want to run past your colleagues first or sections of the design that you want to visualize before you begin programming.</li>
<li>With <b>reverse engineering</b>, you use sketches to explain how some parts of the system woks. You don't show every class, simply those that are interesting and worth talking about before you dig into the code.</li>
<li>The tools used for sketching are lightweight drawing tools, and often people aren't too particular about keeping to every strict rule of the UML.</li>
<li>In sketching the focus is communication rather than completeness.</li>
</ul></li>
<li><b>UML as blueprint:</b>
<ul class="org-ul">
<li>UML as blueprint is about completeness.</li>
<li><b>In forward engineering</b>, the idea is that blueprints are developed by a designer whose )ob is to build a detailed design for a programmer to code up. That design should be sufficiently complete in that all design decisions are laid out, and the programmer should be able to follow it as a pretty straightforward activity that requires little thought. The designer may be the same person as the programmer, but usually the designer is a more senior developer who designs for a team of programmers. The inspiration for this approach is other forms of engineering in which Professional engineers create engineering drawings that are handed over to construction companies to build.</li>
<li>A common approach is for a designer to develop blueprint-level models as far as interfaces of subsystems but then let developers work out the details of implementing those details.</li>
<li><b>In reverse engineering</b>, blueprints aim to convey detailed information about the code either in paper documents or as an interactive graphical browser . The blueprints can show every detail about a class in a graphical form that's easier for developers to understand.</li>
<li>Blueprints require much more sophisticated tools than sketches do in order to handle the details required for the task . Specialized CASE (computer-aided software engineering) tools fall into this category.</li>
<li>Forward-engineering tools support diagram drawing and back it up with a repository to hold the information. Reverse-engineering tools read source code and interpret from it to the repository and generate diagrams. Tools that can do both forward and reverse engineering like this are referred to as a <b>round-trip</b> tools.</li>
<li>The line between blueprints and Sketches is somewhat blurry, but the distinction, I think, rests an the fact that sketches are deliberately incomplete, highlighting important information, while blueprints intend to be comprehensive, often with the aim of reducing programming to a simple and fairly mechanical activity. In a sound bite, I'd say that sketches are explorative, while blueprints are definitive.</li>
<li>As you do more and more in the UML and the programming gets increasingly mechanical, it becomes obvious that the programming should be automated. Indeed, many CASE tools do some form of code generation, which automates building a significant part of a system. Eventually, however, you reach the point at which all the System can be specified in the UML, and you reach UML as programming language.</li>
</ul></li>
<li><b>UML as programming language:</b>
<ul class="org-ul">
<li>In this environment, developers draw UML diagrams that are compiled directly into executable code, the UML becomes the source code.Obviously, this usage of UML demands particularly sophisticated tooling . (Also, the notions of forward and reverse engineering don't make any sense for this mode, as the UML and source code are the same thing.)</li>
<li></li>
</ul></li>
</ol>
</div>
</div>
