UML/uml.org
** UML Diagrams
- UML 2 describes 13 official diagram types listed in the following table:

  |----+----------------------+---------------------------------------------------|
  | No | Diagram              | purpose                                           |
  |----+----------------------+---------------------------------------------------|
  |  1 | Activity             | Procedural and parallel behavior                  |
  |----+----------------------+---------------------------------------------------|
  |  2 | Class                | Class, features, and relationships                |
  |----+----------------------+---------------------------------------------------|
  |  3 | Communication        | Interaction between objects; emphasis on links    |
  |----+----------------------+---------------------------------------------------|
  |  4 | Component            | Structure and connections of components           |
  |----+----------------------+---------------------------------------------------|
  |  5 | Composite Structure  | Runtime decomposition of a class                  |
  |----+----------------------+---------------------------------------------------|
  |  6 | Deployment           | Deployment of artifacts to nodes                  |
  |----+----------------------+---------------------------------------------------|
  |  7 | Interaction overview | Mix of sequence and activity diagram              |
  |----+----------------------+---------------------------------------------------|
  |  8 | Object               | Examples of configuration instances               |
  |----+----------------------+---------------------------------------------------|
  |  9 | Package              | Compile-time hierarchic structure                 |
  |----+----------------------+---------------------------------------------------|
  | 10 | Sequence             | Interaction between objects; emphasis on sequence |
  |----+----------------------+---------------------------------------------------|
  | 11 | State machine        | How events change an object over its life         |
  |----+----------------------+---------------------------------------------------|
  | 12 | Timing               | Interaction between objects; emphasis on timing   |
  |----+----------------------+---------------------------------------------------|
  | 13 | Use case             | How users interact with a system                  |
  |----+----------------------+---------------------------------------------------|

- Those above diagrams can be categorized into to main diagrams:
  1) *Structure Diagram:*
     - This category includes: class diagram, component diagram, composite structure diagram, deployment diagram, object diagram and package diagram.
  2) *Behavior diagram:*
     - This category contains the following diagrams:
       + Activity diagram, use case diagram, state machine diagram
       + Interaction diagram: this category includes sequence diagram, communication diagram, timing diagram, and interaction overview diagram.
- Where to start with UML? Concentrate first on the basic forms of class diagrams and sequence diagrams. These are the most common and most useful diagram types.
* Development Process
** Iterative and Waterfall process
- The essential difference between the two is how you break up a project into smaller chunks. For example, if  you have a project that you think will take a  year, few people are comfortable telling the team to go away for a year and come back when done. Some break down is needed so that people can approach the problem and track the progress.
- The *waterfall* style breaks down a project based on activity. To build a software, you have to do certain activities: requirement analysis, design, coding, and testing. A 1-year project might thus have a 2-month analysis phase, followed by a 4-month design phase, followed by a 3-month coding phase, followed by a 3-month testing phase.
- The *iterative* style breaks down a project by subset of functionality. You may take a year and break into 3-month iterations. In the first iteration, you would take quarter of the requirements and do the complete software life cycle for that quarter: analysis, design, code and test. At the end of the first iteration, you would have a system that does a quarter of the needed functionality. Then you would do a second iteration, so that at the end of 6 months,  you'd have a system that does half of the functionality.
- The above is a simplified description, but it is the essence of the difference.
- With waterfall development, there is usually some form of formal handoff between each phase, but there are often backflows. During coding, something may come up that causes you to revisit the analysis and design. You certainly should not assume that all design is finished when coding begins. It's inevitable that analysis and design decisions will have to be revisited in later phases. However, these backflows are exceptions and should be minimized as much as possible.
- With iteration, you usually see some form of exploration activity before the true iterations begin. You may well not put the system into production at the end of each iteration, but the system should be production quality.
- Iterative development has come under many names: incremental, spiral, evolutionary, and jacuzzi spring. various people make distinctions among them, but the distinctions are neither widely agreed an nor that important compared to the iterative/waterfall dichotomy.
- You can have hybrid approaches. In a *staged delivery,* analysis and high-level design are done first, a waterfall style, and then coding and testing are divided up into iterations.
- A common technique with iteration is to use *time boxing*. This forces an iteration to be a fixed length of time. If it appears that you can't build all you intended to build during an iteration, you must decide to slip some functionality from the iteration; you must not slip the date of the iteration.
- One of the most common concerns about iterative development is the issue of rework. Iterative development explicitly assumes that you will be reworking and deleting existing code during the later iterations of a project. In many domains, such as manufacturing, rework is seen as a waste. But software isn't like manufacturing; as a result, it often is more efficient to rework existing code than to patch around code that was poorly designed. A number of technical practices can greatly help make rework be more efficient.
  + *Automated regression tests* help by allowing you to quickly detect any defects that may have been introduced when you are changing things. The xUnit family of testing frameworks is a particularly valuable tool for building automated unit tests. e.g., JUnit test. A good rule of thumb is that the size of your unit test code should be about the same size as your production code.
  + *Refactoring* is a disciplined technique for changing existing software. Refactoring works by using a series of small behavior-preserving transformations to the code base. Many of these transformations can be automated.
  + *Continuous integration* keeps a team in sync to avoid painful integration cycles. At the heart of this lies a fully automated build process that can be kicked off automatically whenever any member of the team checks code into the code base.
- All these technical practices have been popularized recently by Extreme Programming(XP).
