UML/uml.html
<div id="outline-container-org0ba5ea9" class="outline-3">
<h3 id="org0ba5ea9"><span class="section-number-3">1.2.</span> UML Diagrams</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><p>
UML 2 describes 13 official diagram types listed in the following table:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">No</th>
<th scope="col" class="org-left">Diagram</th>
<th scope="col" class="org-left">purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Activity</td>
<td class="org-left">Procedural and parallel behavior</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">Class</td>
<td class="org-left">Class, features, and relationships</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-left">Communication</td>
<td class="org-left">Interaction between objects; emphasis on links</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">Component</td>
<td class="org-left">Structure and connections of components</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">5</td>
<td class="org-left">Composite Structure</td>
<td class="org-left">Runtime decomposition of a class</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">6</td>
<td class="org-left">Deployment</td>
<td class="org-left">Deployment of artifacts to nodes</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">7</td>
<td class="org-left">Interaction overview</td>
<td class="org-left">Mix of sequence and activity diagram</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">8</td>
<td class="org-left">Object</td>
<td class="org-left">Examples of configuration instances</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">9</td>
<td class="org-left">Package</td>
<td class="org-left">Compile-time hierarchic structure</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-left">Sequence</td>
<td class="org-left">Interaction between objects; emphasis on sequence</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">11</td>
<td class="org-left">State machine</td>
<td class="org-left">How events change an object over its life</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">12</td>
<td class="org-left">Timing</td>
<td class="org-left">Interaction between objects; emphasis on timing</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">13</td>
<td class="org-left">Use case</td>
<td class="org-left">How users interact with a system</td>
</tr>
</tbody>
</table></li>

<li>Those above diagrams can be categorized into to main diagrams:
<ol class="org-ol">
<li><b>Structure Diagram:</b>
<ul class="org-ul">
<li>This category includes: class diagram, component diagram, composite structure diagram, deployment diagram, object diagram and package diagram.</li>
</ul></li>
<li><b>Behavior diagram:</b>
<ul class="org-ul">
<li>This category contains the following diagrams:
<ul class="org-ul">
<li>Activity diagram, use case diagram, state machine diagram</li>
<li>Interaction diagram: this category includes sequence diagram, communication diagram, timing diagram, and interaction overview diagram.</li>
</ul></li>
</ul></li>
</ol></li>
<li>Where to start with UML? Concentrate first on the basic forms of class diagrams and sequence diagrams. These are the most common and most useful diagram types.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1baa36e" class="outline-2">
<h2 id="org1baa36e"><span class="section-number-2">2.</span> Development Process</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5d44546" class="outline-3">
<h3 id="org5d44546"><span class="section-number-3">2.1.</span> Iterative and Waterfall process</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>The essential difference between the two is how you break up a project into smaller chunks. For example, if  you have a project that you think will take a  year, few people are comfortable telling the team to go away for a year and come back when done. Some break down is needed so that people can approach the problem and track the progress.</li>
<li>The <b>waterfall</b> style breaks down a project based on activity. To build a software, you have to do certain activities: requirement analysis, design, coding, and testing. A 1-year project might thus have a 2-month analysis phase, followed by a 4-month design phase, followed by a 3-month coding phase, followed by a 3-month testing phase.</li>
<li>The <b>iterative</b> style breaks down a project by subset of functionality. You may take a year and break into 3-month iterations. In the first iteration, you would take quarter of the requirements and do the complete software life cycle for that quarter: analysis, design, code and test. At the end of the first iteration, you would have a system that does a quarter of the needed functionality. Then you would do a second iteration, so that at the end of 6 months,  you'd have a system that does half of the functionality.</li>
<li>The above is a simplified description, but it is the essence of the difference.</li>
<li>With waterfall development, there is usually some form of formal handoff between each phase, but there are often backflows. During coding, something may come up that causes you to revisit the analysis and design. You certainly should not assume that all design is finished when coding begins. It's inevitable that analysis and design decisions will have to be revisited in later phases. However, these backflows are exceptions and should be minimized as much as possible.</li>
<li>With iteration, you usually see some form of exploration activity before the true iterations begin. You may well not put the system into production at the end of each iteration, but the system should be production quality.</li>
<li>Iterative development has come under many names: incremental, spiral, evolutionary, and jacuzzi spring. various people make distinctions among them, but the distinctions are neither widely agreed an nor that important compared to the iterative/waterfall dichotomy.</li>
<li>You can have hybrid approaches. In a <b>staged delivery,</b> analysis and high-level design are done first, a waterfall style, and then coding and testing are divided up into iterations.</li>
<li>A common technique with iteration is to use <b>time boxing</b>. This forces an iteration to be a fixed length of time. If it appears that you can't build all you intended to build during an iteration, you must decide to slip some functionality from the iteration; you must not slip the date of the iteration.</li>
<li>One of the most common concerns about iterative development is the issue of rework. Iterative development explicitly assumes that you will be reworking and deleting existing code during the later iterations of a project. In many domains, such as manufacturing, rework is seen as a waste. But software isn't like manufacturing; as a result, it often is more efficient to rework existing code than to patch around code that was poorly designed. A number of technical practices can greatly help make rework be more efficient.
<ul class="org-ul">
<li><b>Automated regression tests</b> help by allowing you to quickly detect any defects that may have been introduced when you are changing things. The xUnit family of testing frameworks is a particularly valuable tool for building automated unit tests. e.g., JUnit test. A good rule of thumb is that the size of your unit test code should be about the same size as your production code.</li>
<li><b>Refactoring</b> is a disciplined technique for changing existing software. Refactoring works by using a series of small behavior-preserving transformations to the code base. Many of these transformations can be automated.</li>
<li><b>Continuous integration</b> keeps a team in sync to avoid painful integration cycles. At the heart of this lies a fully automated build process that can be kicked off automatically whenever any member of the team checks code into the code base.</li>
</ul></li>
<li>All these technical practices have been popularized recently by Extreme Programming(XP).</li>
</ul>
</div>
</div>
