UML/uml.org
** Predictive and Adaptive planning
- Nothing is more frustrating than not having a clear idea how much it will cost to build some software and how long it will take to build it.
- One of the unique sources of complexity in software projects is the difficulty in understanding the requirements for a software system. The majority of software projects experience significant *requirements churn:* changes in requirements in the later stages of the project. These changes shatter the foundation of a predictive plan. You can combat these changes by freezing the requirements early on and not permitting changes, but this runs the risk of delivering a system that no longer meets the needs of its user.
- This problem leads to two very different reactions:
  1) Put more effort into the requirements process itself.
  2) requirement churn is unavoidable, that is too difficult for many projects to stabilize requirements sufficiently to use a predictive plan. This may be either owing to the sheer difficulty of envisioning what software can do or because market conditions force unpredictable changes. This thought advocates *adaptive planing*, whereby predictivity is seen as an illusion.
- Instead of fooling ourselves with illusory predictability, we should face the reality of constant change and use a planning approach that treats change as a constant in a software project. This change is controlled so that the project delivers the best software it can; but although the project is controllable, it is not predictable.
- When people talk about a project that's doing well because it is going according to plan, that is predictive form of thinking. You can't say "according to plan" in adaptive environment, because the plan is always changing. This doesn't mean that adaptive projects don't plan; they usually plan a lot, but the plan is treated as a baseline to assess the consequences of change rather than as a prediction of the future.
- With a predictive plan, you can develop a fixed-price/fixed-scope contract. Such a contract says exactly what should be built, how much it will cost, and when it will be delivered. Such fixing isn't possible with an adaptive plan. You can fix a budget and a time for delivery, but you can't fix what functionality will be delivered. An adaptive contract assumes that the users will collaborate with the development team to regularly reassess what functionality needs to be built and will cancel the project if progress ends up being too slow. As such, an adaptive planning process can be fixed price/variable scope.
- Naturally, the adaptive approach is less desirable, as anyone would prefer greater predictability in a software project. However, predictability depends an a precise, accurate, and stable set of requirements. If you cannot stabilize your requirements, the predictive plan is based an sand and the chances are high that the project goes off course. This leads to two important pieces of advice:
  1) Don't make a predictive plan until you have precise and accurate requirements and are confident they won't significantly change.
  2) If you can't get precise, accurate, and stable requirements, use an adaptive planning styles.
- An adaptive plan absolutely requires an iterative process. Predictive planning can be done either way, although it easier to see how it works with waterfall or staged delivery approach.
** Agile Processes
- /Agile/ is an umbrella term that covers many processes that share a common set of values and principles as defined by the *Manifesto of Agile Software Development*. Examples of these processes are:
  + Extreme Programming(XP)
  + Scrum
  + Feature Driven Development(FDD)
  + Crystal
  + Dynamic Systems Development Method(DSDM)
- Agile processes are strongly adaptive in their nature. They are also very much people-oriented processes. Agile approaches assume that the most important factor in a project's success is the quality of the people on the project and how well they work together in human terms. which process they use and which tools they use are strictly second-order effects.
- Agile methods tend to use short, time-boxed iterations, most often of a month or less. Because they don't attach much weight to documents, agile approaches disdain using the UML in blueprint mode.
- 
** Fitting a process into a project
** Fitting UML into a process
*** Requirement Analysis
- The activity of requirement analysis involves trying to figure out what the users and customers of a software effort want the system to do. A number of UML techniques can come in handy here:
  + Use cases, which describes how people interact with system
  + A class diagram drawn from the conceptual perspective, which can be a good way of building up a rigorous vocabulary of the domain.
  + An activity diagram, which can show the work flow of the organization, showing how software and human activities interact.
  + A state diagram, which can be useful if a concept has an interesting life cycle, with various states and events that change that state.
- When working in requirements analysis, remember that the most important thing is communication with your users and customers.
*** Design
- When you are doing design, you can get more technical with your diagrams. You can use more notation and be more precise about your notation. Some useful techniques are:
  + Class diagrams from a software perspective. These show the classes in the software and how they interrelate.
  + Sequence diagrams for common scenarios. A valuable approach is to pick the most important and interesting scenarios from the use cases and use CRC cards or sequence diagrams to figure out what happens in the software.
  + Package diagrams to show the large-scale organization of the software.
  + State diagrams for classes with complex life histories.
  + Deployment diagrams to show the physical layout of the software.
*** Documentation
- Once you have built the software,  you can use the UML to help document what you have done.
* Class Diagrams: The Essentials
- The majority of UML diagrams we see are class diagrams.
- A *class diagram* describes the types of objects in the system and the various kinds of static relationship that exist among them. Class diagrams also show the properties and operations of a class and the constraints that apply to the way objects are connected. The UML uses the term *feature* as a general term that covers properties and operations of a class.
