UML/uml.html
<div id="outline-container-org765c480" class="outline-3">
<h3 id="org765c480"><span class="section-number-3">2.2.</span> Predictive and Adaptive planning</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Nothing is more frustrating than not having a clear idea how much it will cost to build some software and how long it will take to build it.</li>
<li>One of the unique sources of complexity in software projects is the difficulty in understanding the requirements for a software system. The majority of software projects experience significant <b>requirements churn:</b> changes in requirements in the later stages of the project. These changes shatter the foundation of a predictive plan. You can combat these changes by freezing the requirements early on and not permitting changes, but this runs the risk of delivering a system that no longer meets the needs of its user.</li>
<li>This problem leads to two very different reactions:
<ol class="org-ol">
<li>Put more effort into the requirements process itself.</li>
<li>requirement churn is unavoidable, that is too difficult for many projects to stabilize requirements sufficiently to use a predictive plan. This may be either owing to the sheer difficulty of envisioning what software can do or because market conditions force unpredictable changes. This thought advocates <b>adaptive planing</b>, whereby predictivity is seen as an illusion.</li>
</ol></li>
<li>Instead of fooling ourselves with illusory predictability, we should face the reality of constant change and use a planning approach that treats change as a constant in a software project. This change is controlled so that the project delivers the best software it can; but although the project is controllable, it is not predictable.</li>
<li>When people talk about a project that's doing well because it is going according to plan, that is predictive form of thinking. You can't say "according to plan" in adaptive environment, because the plan is always changing. This doesn't mean that adaptive projects don't plan; they usually plan a lot, but the plan is treated as a baseline to assess the consequences of change rather than as a prediction of the future.</li>
<li>With a predictive plan, you can develop a fixed-price/fixed-scope contract. Such a contract says exactly what should be built, how much it will cost, and when it will be delivered. Such fixing isn't possible with an adaptive plan. You can fix a budget and a time for delivery, but you can't fix what functionality will be delivered. An adaptive contract assumes that the users will collaborate with the development team to regularly reassess what functionality needs to be built and will cancel the project if progress ends up being too slow. As such, an adaptive planning process can be fixed price/variable scope.</li>
<li>Naturally, the adaptive approach is less desirable, as anyone would prefer greater predictability in a software project. However, predictability depends an a precise, accurate, and stable set of requirements. If you cannot stabilize your requirements, the predictive plan is based an sand and the chances are high that the project goes off course. This leads to two important pieces of advice:
<ol class="org-ol">
<li>Don't make a predictive plan until you have precise and accurate requirements and are confident they won't significantly change.</li>
<li>If you can't get precise, accurate, and stable requirements, use an adaptive planning styles.</li>
</ol></li>
<li>An adaptive plan absolutely requires an iterative process. Predictive planning can be done either way, although it easier to see how it works with waterfall or staged delivery approach.</li>
</ul>
</div>
</div>
<div id="outline-container-org1722479" class="outline-3">
<h3 id="org1722479"><span class="section-number-3">2.3.</span> Agile Processes</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><i>Agile</i> is an umbrella term that covers many processes that share a common set of values and principles as defined by the <b>Manifesto of Agile Software Development</b>. Examples of these processes are:
<ul class="org-ul">
<li>Extreme Programming(XP)</li>
<li>Scrum</li>
<li>Feature Driven Development(FDD)</li>
<li>Crystal</li>
<li>Dynamic Systems Development Method(DSDM)</li>
</ul></li>
<li>Agile processes are strongly adaptive in their nature. They are also very much people-oriented processes. Agile approaches assume that the most important factor in a project's success is the quality of the people on the project and how well they work together in human terms. which process they use and which tools they use are strictly second-order effects.</li>
<li>Agile methods tend to use short, time-boxed iterations, most often of a month or less. Because they don't attach much weight to documents, agile approaches disdain using the UML in blueprint mode.</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org97eb81c" class="outline-3">
<h3 id="org97eb81c"><span class="section-number-3">2.4.</span> Fitting a process into a project</h3>
</div>
<div id="outline-container-org4339a9e" class="outline-3">
<h3 id="org4339a9e"><span class="section-number-3">2.5.</span> Fitting UML into a process</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgaa80715" class="outline-4">
<h4 id="orgaa80715"><span class="section-number-4">2.5.1.</span> Requirement Analysis</h4>
<div class="outline-text-4" id="text-2-5-1">
<ul class="org-ul">
<li>The activity of requirement analysis involves trying to figure out what the users and customers of a software effort want the system to do. A number of UML techniques can come in handy here:
<ul class="org-ul">
<li>Use cases, which describes how people interact with system</li>
<li>A class diagram drawn from the conceptual perspective, which can be a good way of building up a rigorous vocabulary of the domain.</li>
<li>An activity diagram, which can show the work flow of the organization, showing how software and human activities interact.</li>
<li>A state diagram, which can be useful if a concept has an interesting life cycle, with various states and events that change that state.</li>
</ul></li>
<li>When working in requirements analysis, remember that the most important thing is communication with your users and customers.</li>
</ul>
</div>
</div>
<div id="outline-container-org590377d" class="outline-4">
<h4 id="org590377d"><span class="section-number-4">2.5.2.</span> Design</h4>
<div class="outline-text-4" id="text-2-5-2">
<ul class="org-ul">
<li>When you are doing design, you can get more technical with your diagrams. You can use more notation and be more precise about your notation. Some useful techniques are:
<ul class="org-ul">
<li>Class diagrams from a software perspective. These show the classes in the software and how they interrelate.</li>
<li>Sequence diagrams for common scenarios. A valuable approach is to pick the most important and interesting scenarios from the use cases and use CRC cards or sequence diagrams to figure out what happens in the software.</li>
<li>Package diagrams to show the large-scale organization of the software.</li>
<li>State diagrams for classes with complex life histories.</li>
<li>Deployment diagrams to show the physical layout of the software.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5616312" class="outline-4">
<h4 id="org5616312"><span class="section-number-4">2.5.3.</span> Documentation</h4>
<div class="outline-text-4" id="text-2-5-3">
<ul class="org-ul">
<li>Once you have built the software,  you can use the UML to help document what you have done.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org01a0441" class="outline-2">
<h2 id="org01a0441"><span class="section-number-2">3.</span> Class Diagrams: The Essentials</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>The majority of UML diagrams we see are class diagrams.</li>
<li>A <b>class diagram</b> describes the types of objects in the system and the various kinds of static relationship that exist among them. Class diagrams also show the properties and operations of a class and the constraints that apply to the way objects are connected. The UML uses the term <b>feature</b> as a general term that covers properties and operations of a class.</li>
</ul>
</div>
