UML/uml.org
** Property
- Properties represent structural features of a class. You can think of properties as corresponding to fields in a class. Properties are a single concept, but they appear in two quite distinct notations: *attributes* and *associations*.
- *Attributes*: the attribute notation describes a property as a line of text within the class box itself. The full form of an attribute is:
  /visibility name: type multiplicity = default {property-string}/.
- An example of this is: *- name: String [1] = "Untitled" {readOnly}*
  Only the name is necessary.
  + The visibility marker indicates whether the attribute is public(+) or private(-)
  + The /name/ of the attribute -- how the class refers to the attribute -- roughly corresponds to the name of the field in programming language.
  + The /type/ of the attribute indicates a restriction on what kind of object may be placed in the attribute. You can think of this as the type of a field in programming language.
  + /Multiplicity/ of a property is an indication of how many objects may fill the property.
  + The /default value/ is the value for a newly created object if the attribute isn't specified during creation.
  + The {property-string} allows you to indicate additional properties for the attribute. In the example I used {readOnly} to indicate that clients may not modify the property. If this is missing, you can usually assume that the attribute is modifiable.
- *Associations*: this is another way to notate a property is an association. Much of the same information that you can show on an attribute appears on an association. An association is a solid line between two classes, directed from directed from the source class to the target class. The name of the property goes at the target end of the association, together with its multiplicity. The target end of the association links to the class that is the type of the property.
- *Multiplicity*: The multiplicity of a property is an indication of how many objects may fill the property. The most common multiplicities you will see are:
  + *1* (An order must have exactly one customer)
  + *0..1* (A corporate customer may or may not have a single sales rep.)
  + *** (A customer need not place a Order and there is no upper limit to the number of Orders a customer may place-- zero or more Orders)
** Operations
- Operations are the actions that a class knows to carry out. Operations most obviously correspond to the methods on a class. Normally, you don't show those operations that simply manipulate properties, because they can usually be inferred.
- The full UML syntax for operation is:
  /visibility name (parameter-list) : return-type {property-string}/
  + The /visibility/ marker is public(+) and private(-);
  + The /name/ is a string
  + The /parameter-list/ is the list of parameters for the operations
  + The /return-type/ is the type of the returned value, if there is one.
  + The /property-string/ indicates property values that apply to the given operation
- The parameters in the parameter list are notated in a similar way to attributes. The form is:
  /direction name: type = default value/
  + The /name, type,/ and /default value/ are the same as for attributes.
  + The /direction/ indicates whether the parameter is input(/in/), output(/out/) or both(/inout/). If no direction is shown, it's assumed to be /in/.
    An example operation on account might be:
    /+ balanceOn (date: Date) : Money/
- With conceptual models, you shouldn't use operations to specify the interface of a class. Instead use them to indicate the principal responsibility of that class, perhaps a couple of words summarizing a CRC responsibility.
- I often find it useful to distinguish between operations that change the state of the system and those that don't. UML defines a *query* as an operation that gets a value from a class without changing the system state -- in other words without side effects. You can mark such an operation with the property string {query}. I refer to operations that do change state as *modifiers*, also called *commands.*
  Strictly, the difference between query and modifiers is whether they change the observable state. The observable state is what can be perceived from the outside. An operation that updates a cache would alter the internal state but would have no effect that is observable from the outside.
- A common convention is to try to write operations so that modifiers don't return a value; that way, you can rely on the fact that operations that return a value are queries.
- Another distinction between operation and method. An *operation* is something that is invoked on an object -- the procedure declaration -- where as a *method* is the body of a procedure. The two are different when  you have polymorphism. If you have a supertype with three subtypes, each of which overrides the supertype's getPrice operation, you have one operation and four methods that implement it.
** Notes and Comments
- Notes are comments in the diagram. Notes can be stand on their own, or they can be linked with a dashed line to the elements they are commenting.
