UML/uml.html
<div id="outline-container-org2eb4b92" class="outline-3">
<h3 id="org2eb4b92"><span class="section-number-3">3.1.</span> Property</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Properties represent structural features of a class. You can think of properties as corresponding to fields in a class. Properties are a single concept, but they appear in two quite distinct notations: <b>attributes</b> and <b>associations</b>.</li>
<li><b>Attributes</b>: the attribute notation describes a property as a line of text within the class box itself. The full form of an attribute is:
<i>visibility name: type multiplicity = default {property-string}</i>.</li>
<li>An example of this is: <b>- name: String [1] = "Untitled" {readOnly}</b>
Only the name is necessary.
<ul class="org-ul">
<li>The visibility marker indicates whether the attribute is public(+) or private(-)</li>
<li>The <i>name</i> of the attribute &#x2013; how the class refers to the attribute &#x2013; roughly corresponds to the name of the field in programming language.</li>
<li>The <i>type</i> of the attribute indicates a restriction on what kind of object may be placed in the attribute. You can think of this as the type of a field in programming language.</li>
<li><i>Multiplicity</i> of a property is an indication of how many objects may fill the property.</li>
<li>The <i>default value</i> is the value for a newly created object if the attribute isn't specified during creation.</li>
<li>The {property-string} allows you to indicate additional properties for the attribute. In the example I used {readOnly} to indicate that clients may not modify the property. If this is missing, you can usually assume that the attribute is modifiable.</li>
</ul></li>
<li><b>Associations</b>: this is another way to notate a property is an association. Much of the same information that you can show on an attribute appears on an association. An association is a solid line between two classes, directed from directed from the source class to the target class. The name of the property goes at the target end of the association, together with its multiplicity. The target end of the association links to the class that is the type of the property.</li>
<li><b>Multiplicity</b>: The multiplicity of a property is an indication of how many objects may fill the property. The most common multiplicities you will see are:
<ul class="org-ul">
<li><b>1</b> (An order must have exactly one customer)</li>
<li><b>0..1</b> (A corporate customer may or may not have a single sales rep.)</li>
<li><b>*</b> (A customer need not place a Order and there is no upper limit to the number of Orders a customer may place&#x2013; zero or more Orders)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0483a44" class="outline-3">
<h3 id="org0483a44"><span class="section-number-3">3.2.</span> Operations</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Operations are the actions that a class knows to carry out. Operations most obviously correspond to the methods on a class. Normally, you don't show those operations that simply manipulate properties, because they can usually be inferred.</li>
<li>The full UML syntax for operation is:
<i>visibility name (parameter-list) : return-type {property-string}</i>
<ul class="org-ul">
<li>The <i>visibility</i> marker is public(+) and private(-);</li>
<li>The <i>name</i> is a string</li>
<li>The <i>parameter-list</i> is the list of parameters for the operations</li>
<li>The <i>return-type</i> is the type of the returned value, if there is one.</li>
<li>The <i>property-string</i> indicates property values that apply to the given operation</li>
</ul></li>
<li>The parameters in the parameter list are notated in a similar way to attributes. The form is:
<i>direction name: type = default value</i>
<ul class="org-ul">
<li>The <i>name, type,</i> and <i>default value</i> are the same as for attributes.</li>
<li>The <i>direction</i> indicates whether the parameter is input(<i>in</i>), output(<i>out</i>) or both(<i>inout</i>). If no direction is shown, it's assumed to be <i>in</i>.
An example operation on account might be:
<i>+ balanceOn (date: Date) : Money</i></li>
</ul></li>
<li>With conceptual models, you shouldn't use operations to specify the interface of a class. Instead use them to indicate the principal responsibility of that class, perhaps a couple of words summarizing a CRC responsibility.</li>
<li>I often find it useful to distinguish between operations that change the state of the system and those that don't. UML defines a <b>query</b> as an operation that gets a value from a class without changing the system state &#x2013; in other words without side effects. You can mark such an operation with the property string {query}. I refer to operations that do change state as <b>modifiers</b>, also called <b>commands.</b>
Strictly, the difference between query and modifiers is whether they change the observable state. The observable state is what can be perceived from the outside. An operation that updates a cache would alter the internal state but would have no effect that is observable from the outside.</li>
<li>A common convention is to try to write operations so that modifiers don't return a value; that way, you can rely on the fact that operations that return a value are queries.</li>
<li>Another distinction between operation and method. An <b>operation</b> is something that is invoked on an object &#x2013; the procedure declaration &#x2013; where as a <b>method</b> is the body of a procedure. The two are different when  you have polymorphism. If you have a supertype with three subtypes, each of which overrides the supertype's getPrice operation, you have one operation and four methods that implement it.</li>
</ul>
</div>
</div>
<div id="outline-container-org0232868" class="outline-3">
<h3 id="org0232868"><span class="section-number-3">3.3.</span> Notes and Comments</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Notes are comments in the diagram. Notes can be stand on their own, or they can be linked with a dashed line to the elements they are commenting.</li>
</ul>
</div>
</div>
