UML/uml.org
** Dependency
- A dependency exists between two elements if changes to the definition of one element(the *supplier*) may cause changes to the other (the *client*). With classes, dependency exists for various reasons: One class send message to another; one class has another as part of its data; one class mentions another as a parameter to an operation. If a class changes its interface, any message sent to that class may no longer be valid.
- As computer systems grow, you have to worry more and more about controlling dependencies. If dependencies get out of control, each change to a System has a wide ripple effect as more and more things have to change. The bigger the ripple, the harder it is to change anything.
- The UML allows you to depict dependencies between all sorts of elements. You use dependencies whenever you want to show how changes in one element might alter other elements.
- The basic dependency is not a transitive relationship. An example of *transitive* relationship is the "larger beard" relationship. If Jim has a larger beard than Grady, and Grady has a larger beard than Ivar, we can deduce that Jim has a larger beard than Ivar. Some kind of dependencies, such as substitute, are transitive, but in most cases there is a significant difference between direct and indirect dependencies.
- Many UML relationships imply a dependency. Selected dependency keywords:

  | Keyword         | Meaning                                                                        |
  |-----------------+--------------------------------------------------------------------------------|
  | <<call>>        | The source calls an operation in the target                                    |
  |-----------------+--------------------------------------------------------------------------------|
  | <<create>>      | The source creates an instance of the target                                   |
  |-----------------+--------------------------------------------------------------------------------|
  | <<derive>>      | The source is derived from the target                                          |
  |-----------------+--------------------------------------------------------------------------------|
  | <<instantiate>> | The source is an instance of the target(Note that if the source is a class)    |
  |                 | the class itself is the instance of the class class; that is the target class  |
  |                 | is a metaclass).                                                               |
  |-----------------+--------------------------------------------------------------------------------|
  | <<permit>>      | The target allows the source to access the target's private features           |
  |-----------------+--------------------------------------------------------------------------------|
  | <<realize>>     | The source is an implementation of a specification or interface defined by the |
  |                 | the target                                                                     |
  |-----------------+--------------------------------------------------------------------------------|
  | <<refine>>      | Refinement indicates a relationship between different semantic levels;         |
  |                 | for example: the source might be a design class and the target the             |
  |                 | corresponding analysis class                                                   |
  |-----------------+--------------------------------------------------------------------------------|
  | <<substitute>>  | The source is substitutable for the target                                     |
  |-----------------+--------------------------------------------------------------------------------|
  | <<trace>>       | Used to track such things as requirements to classes or how changes in one     |
  |                 | model link to change elsewhere                                                 |
  |-----------------+--------------------------------------------------------------------------------|
  | <<use>>         | The source requires the target for its implementation.                         |
  |-----------------+--------------------------------------------------------------------------------|

- Your general rule should be to minimize dependencies, particularly when they cross large areas of a system. In particular, you should be wary of cycles, as they can lead to a cycle of changes.
- Be selective and Show dependencies only when they are directly relevant to the particular topic that you want to communicate. To understand and control dependencies, you are best off using them with package diagrams.
** Constraint Rules
- Much of what you doing in drawing a class diagram is indicating constraints. The UML allows you to use anything to describe constraints. The only rule is that you put them inside braces ({}). You can use natural language, programming language, or the UML's formal Object Constraint Language(OCL) which is based on predicate calculus.
** When to use Class diagrams?
- Class diagrams are the backbone of UML, so you will find yourself using them all the time.
- The biggest danger with class diagrams is that you can focus exclusively an structure and ignore behavior. Therefore, when drawing class diagrams to understand software, always do them in conjunction with some form of behavioral technique.
* Sequence Diagrams
- *Interaction diagrams* describe how groups of objects collaborate in some behavior. The UML defines several forms of interaction diagram, of which the  most common is the sequence diagram.
- Typically, a sequence diagram captures the behavior of single scenario. The diagram shows a number of example objects and the messages that are passed between those objects within the use case.
- Each lifeline has an activation bar that shows when the participant is active in the interaction. This corresponds to one of the participant's methods being on the stack. Naming often is useful to correlate participants on the diagram.
- A fuller syntax for participant is /name: Class/, where both the name and class are optional, but you must keep the colon(:) if you use the class.
** Creating and deleting Participants
- Sequence diagram show some extra notation for creating and deleting participants. To create a participant, you draw the message arrow directly into the participant box. Deletion of a participant is indicated by big X. A message arrow going into the X indicates one participant explicitly deleting another; an X at the end of lineline shows a participant deleting itself.
- In a garbage-collected environment, you don't delete objects directly, but it's still worth using the X to indicate when an object is no longer needed and is ready to be collected. It's also appropriate for close operations, indicating that the object isn't usable any more.
