UML/uml.html
<div id="outline-container-orgc1f2c08" class="outline-3">
<h3 id="orgc1f2c08"><span class="section-number-3">3.4.</span> Dependency</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>A dependency exists between two elements if changes to the definition of one element(the <b>supplier</b>) may cause changes to the other (the <b>client</b>). With classes, dependency exists for various reasons: One class send message to another; one class has another as part of its data; one class mentions another as a parameter to an operation. If a class changes its interface, any message sent to that class may no longer be valid.</li>
<li>As computer systems grow, you have to worry more and more about controlling dependencies. If dependencies get out of control, each change to a System has a wide ripple effect as more and more things have to change. The bigger the ripple, the harder it is to change anything.</li>
<li>The UML allows you to depict dependencies between all sorts of elements. You use dependencies whenever you want to show how changes in one element might alter other elements.</li>
<li>The basic dependency is not a transitive relationship. An example of <b>transitive</b> relationship is the "larger beard" relationship. If Jim has a larger beard than Grady, and Grady has a larger beard than Ivar, we can deduce that Jim has a larger beard than Ivar. Some kind of dependencies, such as substitute, are transitive, but in most cases there is a significant difference between direct and indirect dependencies.</li>
<li><p>
Many UML relationships imply a dependency. Selected dependency keywords:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keyword</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a id="org081efd3"></a></td>
<td class="org-left">The source calls an operation in the target</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="orgc5e7e21"></a></td>
<td class="org-left">The source creates an instance of the target</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="org7703165"></a></td>
<td class="org-left">The source is derived from the target</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="org1500e3c"></a></td>
<td class="org-left">The source is an instance of the target(Note that if the source is a class)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the class itself is the instance of the class class; that is the target class</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">is a metaclass).</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="org9a437c0"></a></td>
<td class="org-left">The target allows the source to access the target's private features</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="org6cb72d5"></a></td>
<td class="org-left">The source is an implementation of a specification or interface defined by the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the target</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="orgb0e8bbc"></a></td>
<td class="org-left">Refinement indicates a relationship between different semantic levels;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">for example: the source might be a design class and the target the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">corresponding analysis class</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="orgfdf3bfc"></a></td>
<td class="org-left">The source is substitutable for the target</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="orgecc95b9"></a></td>
<td class="org-left">Used to track such things as requirements to classes or how changes in one</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">model link to change elsewhere</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a id="org7b8ee87"></a></td>
<td class="org-left">The source requires the target for its implementation.</td>
</tr>
</tbody>
</table></li>

<li>Your general rule should be to minimize dependencies, particularly when they cross large areas of a system. In particular, you should be wary of cycles, as they can lead to a cycle of changes.</li>
<li>Be selective and Show dependencies only when they are directly relevant to the particular topic that you want to communicate. To understand and control dependencies, you are best off using them with package diagrams.</li>
</ul>
</div>
</div>
<div id="outline-container-orge039b5b" class="outline-3">
<h3 id="orge039b5b"><span class="section-number-3">3.5.</span> Constraint Rules</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Much of what you doing in drawing a class diagram is indicating constraints. The UML allows you to use anything to describe constraints. The only rule is that you put them inside braces ({}). You can use natural language, programming language, or the UML's formal Object Constraint Language(OCL) which is based on predicate calculus.</li>
</ul>
</div>
</div>
<div id="outline-container-org0b9828b" class="outline-3">
<h3 id="org0b9828b"><span class="section-number-3">3.6.</span> When to use Class diagrams?</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>Class diagrams are the backbone of UML, so you will find yourself using them all the time.</li>
<li>The biggest danger with class diagrams is that you can focus exclusively an structure and ignore behavior. Therefore, when drawing class diagrams to understand software, always do them in conjunction with some form of behavioral technique.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3b28890" class="outline-2">
<h2 id="org3b28890"><span class="section-number-2">4.</span> Sequence Diagrams</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><b>Interaction diagrams</b> describe how groups of objects collaborate in some behavior. The UML defines several forms of interaction diagram, of which the  most common is the sequence diagram.</li>
<li>Typically, a sequence diagram captures the behavior of single scenario. The diagram shows a number of example objects and the messages that are passed between those objects within the use case.</li>
<li>Each lifeline has an activation bar that shows when the participant is active in the interaction. This corresponds to one of the participant's methods being on the stack. Naming often is useful to correlate participants on the diagram.</li>
<li>A fuller syntax for participant is <i>name: Class</i>, where both the name and class are optional, but you must keep the colon(:) if you use the class.</li>
</ul>
</div>
<div id="outline-container-org493db63" class="outline-3">
<h3 id="org493db63"><span class="section-number-3">4.1.</span> Creating and deleting Participants</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Sequence diagram show some extra notation for creating and deleting participants. To create a participant, you draw the message arrow directly into the participant box. Deletion of a participant is indicated by big X. A message arrow going into the X indicates one participant explicitly deleting another; an X at the end of lineline shows a participant deleting itself.</li>
<li>In a garbage-collected environment, you don't delete objects directly, but it's still worth using the X to indicate when an object is no longer needed and is ready to be collected. It's also appropriate for close operations, indicating that the object isn't usable any more.</li>
</ul>
</div>
</div>
