UML/uml.org
** Loops, Conditionals, and the Like
- A common issue with sequence diagrams is how to show looping and conditional behavior. The first thing to point out is that this isn't what sequence diagrams are good at. If you want to show control structures like this, you are better off with an activity diagram or indeed with code itself. Treat sequence diagrams as a visualization of how objects interact rather than as a way of modeling control logic.
- Both loops and conditionals use *interaction frame*, which are a way of marking of a piece of a sequence diagram.
- In general, frames consist of some region of a sequence diagram that is divided into one or more fragments. Each frame has an operator and each fragment may have a guard.
- Here are list of common operators for interaction frames.

  | Operator | Meaning                                                                             |
  |----------+-------------------------------------------------------------------------------------|
  | /alt/      | Alternative multiple fragments; only the one whose condition is true                |
  |          | will execute                                                                        |
  |----------+-------------------------------------------------------------------------------------|
  | /opt/      | Optional; the fragment executes only if the supplied condition is true              |
  |          | Equivalent to /alt/ with only one trace.                                              |
  |----------+-------------------------------------------------------------------------------------|
  | /par/      | Parallel; each fragment is run in parallel                                          |
  |----------+-------------------------------------------------------------------------------------|
  | /loop/     | Loop; the fragment may execute multiple times, and the guard indicates              |
  |          | the basis of iteration                                                              |
  |----------+-------------------------------------------------------------------------------------|
  | /region/   | Critical region; the fragment can have only one thread executing it at once         |
  |----------+-------------------------------------------------------------------------------------|
  | /neg/      | Negative; the fragment shows an invalid interaction                                 |
  |----------+-------------------------------------------------------------------------------------|
  | /ref/      | Reference; reference to an interaction defined on another diagram. The frame is     |
  |          | drawn to cover the lifelines involved in the interaction. You can define parameters |
  |          | and return value                                                                    |
  |----------+-------------------------------------------------------------------------------------|
  | /sd/       | Sequence diagram; used to surround an entire sequence diagram, if you wish.         |
  |----------+-------------------------------------------------------------------------------------|

** Synchronous and Asynchronous Calls
- In UML 2, *filled arrowheads* show a synchronous message, while *stick arrowheads* show an asynchronous message.
- If a caller sends a *synchronous message*, it must wait until the message is done, such as invoking a subroutine. If a caller sends an *asynchronous message*, it can continue processing and doesn't have to wait for a response. You see asynchronous calls in multithreaded applications and in message-oriented middle-ware. Asynchrony gives better responsiveness and reduces the temporal coupling but is harder to debug.
** When to use Sequence diagrams?
- You should use sequence diagrams when you want to look at the behavior of several objects within a single use case. Sequence diagrams are good at showing collaborations among the objects; they are not so good at precise definition of the behavior.
- If you want to look at the behavior of a single object across many use cases, use a *state diagram*. If you want to look at behavior across many use cases or many threads, consider an *activity diagram.*
- Other useful forms of interaction diagrams are communication diagrams, for show connection; and timing diagrams, for showing timing constraints.
** CRC Cards (Class-Responsibility-Collaboration Cards)
- A *responsibility* is a short sentence that summarizes something that an object should do: an action the object performs, some knowledge the object maintains, or some important decisions the object makes. The idea is that you should be able to take any class and summarize it with a handful of responsibilities. Doing that can help you think more clearly about the design of your classes.
- The second *C* refer to *collaborators*: the other classes that this class needs to work with. This gives you some idea of the links between classes -- still at a high level.
- One of the chief benefits of CRC cards is that thev encourage animated, discussion among the developers.
- A comnion mistake 1 see people make is generating long lists of low-level responsibilities. But doing so misses the point. The responsibilities should easily fit an one card.
* Class diagrams: Advanced concepts
** Keywords
- One of the challenges of graphical language is that you have to remember what the symbols mean. With too many, users find it very difficult to remember what all the symbols mean. So the UML often tries to reduce the number of symbols and use keywords instead. If you find that you need a modeling construct that isn't in the UML but is similar to something that is, use the Symbol of the existing UML construct but mark it with a keyword to show that you have something different. An example of this is the *interface*. A UML interface is a class that has only public operations, with no method bodies. Because it's a special kind of class, it's show using a class icon with the keyword /«interface»/
- Some keywords, such as /{abstract}/, show up in curly brackets . It's never really clear what should technically be in guillemets and what should be in curlies.
- Some keywords are so common that they often get abbreviated : /«interface»/ often gets abbreviated to
  /«I»/ and /{abstract}/ to /{A}/
** Static Operations and Attributes
- The UML refers to an operation or an attribute that applies to a class rather than to an instance *static*. This is equivalent to static members in C-based languages. Static features are _underlined_ on a class diagram.
** Aggregation and Composition
- One of the most frequent sources of confusion in the UML is aggregation and composition. *Aggregation* is the part-of relationship. It's like saying that a car has an engine and wheels as its parts. But the difficult thing is considering what the difference is between aggregation and association.
- The "no sharing" rule is key to composition. Composition is a good way of showing properties that own by value, properties to value objects, or properties that have a strong and somewhat exclusive ownership of particular other components.
