UML/uml.html
<div id="outline-container-orgdf7bc11" class="outline-3">
<h3 id="orgdf7bc11"><span class="section-number-3">4.2.</span> Loops, Conditionals, and the Like</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>A common issue with sequence diagrams is how to show looping and conditional behavior. The first thing to point out is that this isn't what sequence diagrams are good at. If you want to show control structures like this, you are better off with an activity diagram or indeed with code itself. Treat sequence diagrams as a visualization of how objects interact rather than as a way of modeling control logic.</li>
<li>Both loops and conditionals use <b>interaction frame</b>, which are a way of marking of a piece of a sequence diagram.</li>
<li>In general, frames consist of some region of a sequence diagram that is divided into one or more fragments. Each frame has an operator and each fragment may have a guard.</li>
<li><p>
Here are list of common operators for interaction frames.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><i>alt</i></td>
<td class="org-left">Alternative multiple fragments; only the one whose condition is true</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">will execute</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><i>opt</i></td>
<td class="org-left">Optional; the fragment executes only if the supplied condition is true</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Equivalent to <i>alt</i> with only one trace.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><i>par</i></td>
<td class="org-left">Parallel; each fragment is run in parallel</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><i>loop</i></td>
<td class="org-left">Loop; the fragment may execute multiple times, and the guard indicates</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the basis of iteration</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><i>region</i></td>
<td class="org-left">Critical region; the fragment can have only one thread executing it at once</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><i>neg</i></td>
<td class="org-left">Negative; the fragment shows an invalid interaction</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><i>ref</i></td>
<td class="org-left">Reference; reference to an interaction defined on another diagram. The frame is</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">drawn to cover the lifelines involved in the interaction. You can define parameters</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">and return value</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><i>sd</i></td>
<td class="org-left">Sequence diagram; used to surround an entire sequence diagram, if you wish.</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-org35defa8" class="outline-3">
<h3 id="org35defa8"><span class="section-number-3">4.3.</span> Synchronous and Asynchronous Calls</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>In UML 2, <b>filled arrowheads</b> show a synchronous message, while <b>stick arrowheads</b> show an asynchronous message.</li>
<li>If a caller sends a <b>synchronous message</b>, it must wait until the message is done, such as invoking a subroutine. If a caller sends an <b>asynchronous message</b>, it can continue processing and doesn't have to wait for a response. You see asynchronous calls in multithreaded applications and in message-oriented middle-ware. Asynchrony gives better responsiveness and reduces the temporal coupling but is harder to debug.</li>
</ul>
</div>
</div>
<div id="outline-container-org2035ab5" class="outline-3">
<h3 id="org2035ab5"><span class="section-number-3">4.4.</span> When to use Sequence diagrams?</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>You should use sequence diagrams when you want to look at the behavior of several objects within a single use case. Sequence diagrams are good at showing collaborations among the objects; they are not so good at precise definition of the behavior.</li>
<li>If you want to look at the behavior of a single object across many use cases, use a <b>state diagram</b>. If you want to look at behavior across many use cases or many threads, consider an <b>activity diagram.</b></li>
<li>Other useful forms of interaction diagrams are communication diagrams, for show connection; and timing diagrams, for showing timing constraints.</li>
</ul>
</div>
</div>
<div id="outline-container-orga5ed9dd" class="outline-3">
<h3 id="orga5ed9dd"><span class="section-number-3">4.5.</span> CRC Cards (Class-Responsibility-Collaboration Cards)</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>A <b>responsibility</b> is a short sentence that summarizes something that an object should do: an action the object performs, some knowledge the object maintains, or some important decisions the object makes. The idea is that you should be able to take any class and summarize it with a handful of responsibilities. Doing that can help you think more clearly about the design of your classes.</li>
<li>The second <b>C</b> refer to <b>collaborators</b>: the other classes that this class needs to work with. This gives you some idea of the links between classes &#x2013; still at a high level.</li>
<li>One of the chief benefits of CRC cards is that thev encourage animated, discussion among the developers.</li>
<li>A comnion mistake 1 see people make is generating long lists of low-level responsibilities. But doing so misses the point. The responsibilities should easily fit an one card.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0baf369" class="outline-2">
<h2 id="org0baf369"><span class="section-number-2">5.</span> Class diagrams: Advanced concepts</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org103bebd" class="outline-3">
<h3 id="org103bebd"><span class="section-number-3">5.1.</span> Keywords</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>One of the challenges of graphical language is that you have to remember what the symbols mean. With too many, users find it very difficult to remember what all the symbols mean. So the UML often tries to reduce the number of symbols and use keywords instead. If you find that you need a modeling construct that isn't in the UML but is similar to something that is, use the Symbol of the existing UML construct but mark it with a keyword to show that you have something different. An example of this is the <b>interface</b>. A UML interface is a class that has only public operations, with no method bodies. Because it's a special kind of class, it's show using a class icon with the keyword <i>interface</i></li>
<li>Some keywords, such as <i>{abstract}</i>, show up in curly brackets . It's never really clear what should technically be in guillemets and what should be in curlies.</li>
<li>Some keywords are so common that they often get abbreviated : <i>interface</i> often gets abbreviated to
<i>I</i> and <i>{abstract}</i> to <i>{A}</i></li>
</ul>
</div>
</div>
<div id="outline-container-org4b09120" class="outline-3">
<h3 id="org4b09120"><span class="section-number-3">5.2.</span> Static Operations and Attributes</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>The UML refers to an operation or an attribute that applies to a class rather than to an instance <b>static</b>. This is equivalent to static members in C-based languages. Static features are <span class="underline">underlined</span> on a class diagram.</li>
</ul>
</div>
</div>
<div id="outline-container-org754f219" class="outline-3">
<h3 id="org754f219"><span class="section-number-3">5.3.</span> Aggregation and Composition</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>One of the most frequent sources of confusion in the UML is aggregation and composition. <b>Aggregation</b> is the part-of relationship. It's like saying that a car has an engine and wheels as its parts. But the difficult thing is considering what the difference is between aggregation and association.</li>
<li>The "no sharing" rule is key to composition. Composition is a good way of showing properties that own by value, properties to value objects, or properties that have a strong and somewhat exclusive ownership of particular other components.</li>
</ul>
</div>
</div>
