UML/uml.org
** Derived Properties
- *Derived properties* can be calculated based on other values. When we think about a date range, we can think of three properties: the start date, the end date, and the number of days in the period. These values are linked, so we can think of the length(end date - start date) as being derived from the other two values.
- Derivation in software perspectives can be interpreted in a couple of different ways. You can use derivation to indicate the difference between a calculated value and a stored value.
** Interfaces and Abstract Classes
- An *abstract class* is a class that cannot be directly instantiated. Instead, you instantiate an instance of a subclass. Typically, an abstract class has one or more operations that are *abstract*. An abstract operation has no implementation; it is pure declaration so that clients can bind to the abstract class.
- The most common way to indicate an abstract class or operation in UML is to /italicize/ the name. You can also make properties abstract, indicating an abstract property or accessor methods. Italics are tricky to do an a white-boards, so you can use the label: {abstract}.
- An interface is a class that has no implementation; that is, all its features are abstract. You mark an interface with the keyword «interface».
- Classes have two kinds of relationships with interfaces: *providing* and *requiring*.
- A class *provides* an interface if it is substitutable for the interface. In Java and .NET, a class can do that by implementing the interface or implementing a subtype of the interface.
- A class requires an interface if it needs an instance of that interface in order to work. Essentially, this is having a dependency an the interface.
** Read-Only and Frozen
- The {readOnly} keywords mark a property that can only be read by clients and that can't be updated. Similar yet different is the {frozen} keyword from UML 1. A property is *frozen* if it can't change during the life time of an object; such properties are often called *immutable*. Although it was dropped from UML 2, {frozen} is a very useful concept, so continue to use it. As well as marking individual properties as frozen, you can apply the keyword to a class to indicate that all properties of all instances are frozen.
- If you need to represent immutability or a similar concept in latest UML diagrams,
  you might need to use custom stereotypes or notes to convey that information.
** Reference Objects and Value Objects
- One of the common things said about objects is that they have identity. This is true, but it is not quite as simple as that. In practice, you find that identity is important for reference objects but not so important for value objects.
- *Reference objects* are such things as Customer. Here, identity is very important because you usually want only one software object to designate a customer in the real world. Any object that references a Customer object will do so through a reference, or a pointer; all objects that reference this Customer will reference the same software object. That way, changes to a Customer available to all users of the Customer. If you have two references to a Customer and with to see whether they are the same, you usually compare their identities.
- *Value Objects* are such things as Date. You often have multiple value objects representing the same object in the real world. For example, it is normal to have hundreds of objects that designate 1-Jan-04. These are all interchangeable copies. New dates are created and destroyed frequently.
- If you have two dates and wish to see whether they are the same, you don't look at their identities but rather at the values they represent. This usually means that you have to write an equality test Operator, which for dates would make a test an year, month, and day-or whatever the internal representation is. Each object that references 1-Jan-04 usually has its own dedicated object, but you can also share dates.
- Value objects should be immutable; in other words, you should not be able to take a date object of 1-Jan-04 and change the same date object to be 2-Jan-04. Instead, you should create a new 2-Jan-04 object and use that instead. The reason is that if the date were shared, you would update another object's date in an unpredictable way, a problem referred to as *aliasing.*
** Qualified Associations
- A *qualified association* is the UML equivalent of a programming concept variously know as associative arrays, maps, hashes, and dictionaries.
** Classification and Generalization
- Many people consider subtyping as /is a/ relationship. But be aware the phrase /is a/ can have different meanings.
- Generalization is transitive; classification is not. I can combine a classification followed by a generalization but not vice versa.
