UML/uml.html
<div id="outline-container-org78bfd4f" class="outline-3">
<h3 id="org78bfd4f"><span class="section-number-3">5.4.</span> Derived Properties</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li><b>Derived properties</b> can be calculated based on other values. When we think about a date range, we can think of three properties: the start date, the end date, and the number of days in the period. These values are linked, so we can think of the length(end date - start date) as being derived from the other two values.</li>
<li>Derivation in software perspectives can be interpreted in a couple of different ways. You can use derivation to indicate the difference between a calculated value and a stored value.</li>
</ul>
</div>
</div>
<div id="outline-container-orgeff3d62" class="outline-3">
<h3 id="orgeff3d62"><span class="section-number-3">5.5.</span> Interfaces and Abstract Classes</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>An <b>abstract class</b> is a class that cannot be directly instantiated. Instead, you instantiate an instance of a subclass. Typically, an abstract class has one or more operations that are <b>abstract</b>. An abstract operation has no implementation; it is pure declaration so that clients can bind to the abstract class.</li>
<li>The most common way to indicate an abstract class or operation in UML is to <i>italicize</i> the name. You can also make properties abstract, indicating an abstract property or accessor methods. Italics are tricky to do an a white-boards, so you can use the label: {abstract}.</li>
<li>An interface is a class that has no implementation; that is, all its features are abstract. You mark an interface with the keyword interface.</li>
<li>Classes have two kinds of relationships with interfaces: <b>providing</b> and <b>requiring</b>.</li>
<li>A class <b>provides</b> an interface if it is substitutable for the interface. In Java and .NET, a class can do that by implementing the interface or implementing a subtype of the interface.</li>
<li>A class requires an interface if it needs an instance of that interface in order to work. Essentially, this is having a dependency an the interface.</li>
</ul>
</div>
</div>
<div id="outline-container-orgeeda8ad" class="outline-3">
<h3 id="orgeeda8ad"><span class="section-number-3">5.6.</span> Read-Only and Frozen</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>The {readOnly} keywords mark a property that can only be read by clients and that can't be updated. Similar yet different is the {frozen} keyword from UML 1. A property is <b>frozen</b> if it can't change during the life time of an object; such properties are often called <b>immutable</b>. Although it was dropped from UML 2, {frozen} is a very useful concept, so continue to use it. As well as marking individual properties as frozen, you can apply the keyword to a class to indicate that all properties of all instances are frozen.</li>
<li>If you need to represent immutability or a similar concept in latest UML diagrams,
you might need to use custom stereotypes or notes to convey that information.</li>
</ul>
</div>
</div>
<div id="outline-container-org06a7aff" class="outline-3">
<h3 id="org06a7aff"><span class="section-number-3">5.7.</span> Reference Objects and Value Objects</h3>
<div class="outline-text-3" id="text-5-7">
<ul class="org-ul">
<li>One of the common things said about objects is that they have identity. This is true, but it is not quite as simple as that. In practice, you find that identity is important for reference objects but not so important for value objects.</li>
<li><b>Reference objects</b> are such things as Customer. Here, identity is very important because you usually want only one software object to designate a customer in the real world. Any object that references a Customer object will do so through a reference, or a pointer; all objects that reference this Customer will reference the same software object. That way, changes to a Customer available to all users of the Customer. If you have two references to a Customer and with to see whether they are the same, you usually compare their identities.</li>
<li><b>Value Objects</b> are such things as Date. You often have multiple value objects representing the same object in the real world. For example, it is normal to have hundreds of objects that designate 1-Jan-04. These are all interchangeable copies. New dates are created and destroyed frequently.</li>
<li>If you have two dates and wish to see whether they are the same, you don't look at their identities but rather at the values they represent. This usually means that you have to write an equality test Operator, which for dates would make a test an year, month, and day-or whatever the internal representation is. Each object that references 1-Jan-04 usually has its own dedicated object, but you can also share dates.</li>
<li>Value objects should be immutable; in other words, you should not be able to take a date object of 1-Jan-04 and change the same date object to be 2-Jan-04. Instead, you should create a new 2-Jan-04 object and use that instead. The reason is that if the date were shared, you would update another object's date in an unpredictable way, a problem referred to as <b>aliasing.</b></li>
</ul>
</div>
</div>
<div id="outline-container-org17980ef" class="outline-3">
<h3 id="org17980ef"><span class="section-number-3">5.8.</span> Qualified Associations</h3>
<div class="outline-text-3" id="text-5-8">
<ul class="org-ul">
<li>A <b>qualified association</b> is the UML equivalent of a programming concept variously know as associative arrays, maps, hashes, and dictionaries.</li>
</ul>
</div>
</div>
<div id="outline-container-org1992fd5" class="outline-3">
<h3 id="org1992fd5"><span class="section-number-3">5.9.</span> Classification and Generalization</h3>
<div class="outline-text-3" id="text-5-9">
<ul class="org-ul">
<li>Many people consider subtyping as <i>is a</i> relationship. But be aware the phrase <i>is a</i> can have different meanings.</li>
<li>Generalization is transitive; classification is not. I can combine a classification followed by a generalization but not vice versa.</li>
</ul>
</div>
</div>
