UML/uml.html
<div id="outline-container-org2c34499" class="outline-3">
<h3 id="org2c34499"><span class="section-number-3">5.10.</span> Multiple and Dynamic Classification</h3>
<div class="outline-text-3" id="text-5-10">
<ul class="org-ul">
<li><b>Classification</b> refers to the relationship between an object and its type. Mainstream programming languages assume that an object belongs to a single class. But there are more options to classification than that.</li>
<li>In <b>single classification</b>, an object belongs to a single type, which may inherit from supertypes. In <b>multiple classification</b>, an object may be described by several types that are not necessarily connected by inheritance.</li>
<li>Multiple classification is different from multiple inheritance. Multiple inheritance says that a type may have many supertypes but that a single type must be defined for each object. Multiple classification allows multiple types for an object without defining a specific type for the purpose.
For example, consider a person subtyped as either man or woman, doctor or nurse, patient or not. Multiple classification allows an object to have any of these types assigned to it in any allowable condition, without the need for types to be defined for all the legal combinations.</li>
<li>If you use multiple classification, you need to be sure that you make it dear which combinations are legal. UML 2 does this by placing each generalization relationship into a generalization Set. On the class diagram, you Label the generalization arrowhead with the name of the generalization Set, which in UML 1 was called the discriminator. Single classification corresponds to a single generalization set with no name.</li>
<li>Generalization sets are by default disjoint: Any instance of the supertype may be an instance of only one of the sub types within that set.</li>
<li>To illustrate, note the following legal combinations of subtypes in the diagram: (Female, Patient, Nurse); (Male, Physiotherapist); (Female, Patient); and (Female, Doctor, Surgeon). The combination (Patient, Doctor, Nurse) is illegal because it contains two types from the role generalization set.</li>
<li>Another question is whether an object may change its class. <b>Dynamic classification</b> allows objects to change class within the sub typing structure; <b>static classification</b> does not. With static classification, a separation is made between types and states; dynamic classification combines these notions.</li>
<li>Should you use multiple, dynamic classification? In the vast majority of UML diagrams, you will see only single static classification, so that should be your default.</li>
</ul>
</div>
</div>
<div id="outline-container-org7029309" class="outline-3">
<h3 id="org7029309"><span class="section-number-3">5.11.</span> Association class</h3>
<div class="outline-text-3" id="text-5-11">
<ul class="org-ul">
<li>Association classes allow you to add attributes, operations, and other features to associations.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf277879" class="outline-3">
<h3 id="orgf277879"><span class="section-number-3">5.12.</span> Template(Parameterized) class</h3>
<div class="outline-text-3" id="text-5-12">
<ul class="org-ul">
<li>his concept is most obviously useful for working with collections in a strongly typed language. This way, you can define behavior for sets in general by defining a template class Set.</li>
</ul>
</div>
</div>
<div id="outline-container-org2495e9f" class="outline-3">
<h3 id="org2495e9f"><span class="section-number-3">5.13.</span> Enumerations</h3>
<div class="outline-text-3" id="text-5-13">
<ul class="org-ul">
<li>Enumerations are used to show a fixed set of values that don't have any properties other than their symbolic values. They are shown as the class with the enumeration keyword.</li>
</ul>
</div>
</div>
<div id="outline-container-org54bf68a" class="outline-3">
<h3 id="org54bf68a"><span class="section-number-3">5.14.</span> Active class</h3>
<div class="outline-text-3" id="text-5-14">
<ul class="org-ul">
<li>An active class has instances, each of which executes and controls its own thread of control . Method invocations may execute in a client's thread or in the active object's thread. A good example of this is a command processor that accepts command objects from the outside and then executes the commands within its own thread of control.</li>
</ul>
</div>
</div>
<div id="outline-container-org614a24a" class="outline-3">
<h3 id="org614a24a"><span class="section-number-3">5.15.</span> visibility</h3>
<div class="outline-text-3" id="text-5-15">
<ul class="org-ul">
<li>Any class has public and private elements. Public elements can be used by any other class; private elements can be used only by the owning class. UML provides four(4) abbreviations for visibility: + (public), - (private), ~(package), and # (protected).</li>
<li>When you are using visibility, use the rules of the language in which you are working. When you are looking at a UML model from elsewhere, be wary of the meanings of the visibility markers, and be aware of how Chose meanings can change from language to language.</li>
</ul>
</div>
</div>
<div id="outline-container-org6205197" class="outline-3">
<h3 id="org6205197"><span class="section-number-3">5.16.</span> Messages</h3>
<div class="outline-text-3" id="text-5-16">
<ul class="org-ul">
<li>Standard UML does not Show any Information about message calls an class diagrams. However, I've sometimes seen conventional diagrams like, arrows to the side of association. The arrows are labeled with the message that one object sends to another.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org89e2d24" class="outline-2">
<h2 id="org89e2d24"><span class="section-number-2">6.</span> Object Diagrams</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>An object diagram is a snapshot of the objects in the system at a point in time. Because it shows instances rather than classes, an object diagram is often called an <b>instance diagram</b>.</li>
<li>You can use an object diagram to show an example configuration of objects.</li>
<li>Each name takes <i>instance name: class name</i>. Both parts of the name are optional, so, John, :Person, and aPerson are legal names. If you use only the class name, you must include the colon(:).</li>
<li>Strictly, the elements of an object diagram are instance specifications rather than true instances. The reason is that it's legal to leave mandatory attributes empty or to Show instance specifications of abstract classes. You can think of an instance specification as a partly defined instance.</li>
</ul>
</div>
<div id="outline-container-org50b0d75" class="outline-3">
<h3 id="org50b0d75"><span class="section-number-3">6.1.</span> When to use Object diagrams?</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Object diagrams are useful for showing examples of objects connected together. In many situations, you can define a structure precisely with a class diagram, but the structure is still difficult to understand. In these situations, a couple of object diagram examples can make all the difference.</li>
</ul>
</div>
</div>
</div>
