UML/uml.org
* Package Diagrams
- Classes represent the basic form of structuring an object-oriented System. Although they are wonderfully useful, you need something more to structure large Systems, which may have hundreds of classes.
- A *package* is a grouping construct that allows you to take any construct in the UML and group its elements together into higher-level units. Its  most common use is to group classes.
- In a UML model, each class is a member of a single package. Packages can also be members of other packages. A package can contain both subpackages and classes.
- Each package represents a *namespace*, which means that every class must have a unique name within its owning package.
- In diagrams, packages are shown with a tabbed folder. You can simply show the package name or show the contents too. At any point, you can use fully qualified names or simply regular names.
- The UML allows classes in a package to be public or private. A public class is part of the interface of the package and can be used by classes in other packages; a private class is hidden.
- A useful technique here is to reduce the interface of the package by exporting only a small subset of the operations associated with the package's public classes. You can do this by giving all classes private visibility, so that they can be seen only by other classes in the same package, and by adding extra public classes for the public behavior. These extra classes, called /facades/, then delegate public operations to their shyler companions in the package.
- How do you choose which classes to put in which packages? Two useful principles for this are the Common Closure Principle and Common Reuse principle. The Common closure principle says that the classes in the package should need changing for similar reasons. The Common Reuse Principle says that classes in a package should all be reused together. Many of the reasons for grouping classes in a packages have to do with the dependencies between the packages.
** Packages and Dependencies
- A *package* diagrams shows packages and their dependencies. A good package structure has a clear flow to the dependencies, a concept that is difficult to define but often easier to recognize.
- Many authors say that there there should be no cycles in the dependencies(the Acyclic Dependency Principle).
- The more dependencies coming into a package, the more stable the package's interface needs to be, as any change in its interface will ripple into all the packages that are dependent on it (the Stable Dependencies Principle).
- Often, you'll find that the more stable packages tend to have a higher proportion of Interfaces and abstract classes (the Stable Abstractions Principle).
- The dependency relationships are not transitive.
** When to use Package diagrams?
- They are useful in large-scale systems to get a picture of the dependencies between major elements of the system.
* Deployment Diagram
- Deployment diagrams show a system's physical layout, revealing which pieces of software runs on what piece of hardware. The main items on the diagram are nodes connected communication paths. A *node* is something that can host software. Nodes come in two forms: A *device* is hardware, it may be a computer or a simpler piece of hardware connected to a system. An *execution environment* is software that itself hosts or contains other software, examples are an operating system or a container process.
- The nodes contains *artifacts*, which are the physical manifestations of software: usually, files. These files might be executables (such as .exe files, binary files, DLLs, JAR files, assemblies, or scripts), or data files, configuration files, HTML documents, and so on. Listing an artifact within a node shows that the artifact is deployed to that node in the running system.
- You can show artifacts either as class boxes or by listing the name within a node.
- Artifacts are often the implementation of a component. To show this, you can use a tagged value in the artifact box.
- Communication paths between nodes indicate how things communicate. You can label these paths with information about the communication protocols that are used.
