UML/uml.html
<div id="outline-container-org8ff78f3" class="outline-2">
<h2 id="org8ff78f3"><span class="section-number-2">7.</span> Package Diagrams</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Classes represent the basic form of structuring an object-oriented System. Although they are wonderfully useful, you need something more to structure large Systems, which may have hundreds of classes.</li>
<li>A <b>package</b> is a grouping construct that allows you to take any construct in the UML and group its elements together into higher-level units. Its  most common use is to group classes.</li>
<li>In a UML model, each class is a member of a single package. Packages can also be members of other packages. A package can contain both subpackages and classes.</li>
<li>Each package represents a <b>namespace</b>, which means that every class must have a unique name within its owning package.</li>
<li>In diagrams, packages are shown with a tabbed folder. You can simply show the package name or show the contents too. At any point, you can use fully qualified names or simply regular names.</li>
<li>The UML allows classes in a package to be public or private. A public class is part of the interface of the package and can be used by classes in other packages; a private class is hidden.</li>
<li>A useful technique here is to reduce the interface of the package by exporting only a small subset of the operations associated with the package's public classes. You can do this by giving all classes private visibility, so that they can be seen only by other classes in the same package, and by adding extra public classes for the public behavior. These extra classes, called <i>facades</i>, then delegate public operations to their shyler companions in the package.</li>
<li>How do you choose which classes to put in which packages? Two useful principles for this are the Common Closure Principle and Common Reuse principle. The Common closure principle says that the classes in the package should need changing for similar reasons. The Common Reuse Principle says that classes in a package should all be reused together. Many of the reasons for grouping classes in a packages have to do with the dependencies between the packages.</li>
</ul>
</div>
<div id="outline-container-org0f43ae0" class="outline-3">
<h3 id="org0f43ae0"><span class="section-number-3">7.1.</span> Packages and Dependencies</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>A <b>package</b> diagrams shows packages and their dependencies. A good package structure has a clear flow to the dependencies, a concept that is difficult to define but often easier to recognize.</li>
<li>Many authors say that there there should be no cycles in the dependencies(the Acyclic Dependency Principle).</li>
<li>The more dependencies coming into a package, the more stable the package's interface needs to be, as any change in its interface will ripple into all the packages that are dependent on it (the Stable Dependencies Principle).</li>
<li>Often, you'll find that the more stable packages tend to have a higher proportion of Interfaces and abstract classes (the Stable Abstractions Principle).</li>
<li>The dependency relationships are not transitive.</li>
</ul>
</div>
</div>
<div id="outline-container-org1ab26ac" class="outline-3">
<h3 id="org1ab26ac"><span class="section-number-3">7.2.</span> When to use Package diagrams?</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>They are useful in large-scale systems to get a picture of the dependencies between major elements of the system.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4932fb4" class="outline-2">
<h2 id="org4932fb4"><span class="section-number-2">8.</span> Deployment Diagram</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Deployment diagrams show a system's physical layout, revealing which pieces of software runs on what piece of hardware. The main items on the diagram are nodes connected communication paths. A <b>node</b> is something that can host software. Nodes come in two forms: A <b>device</b> is hardware, it may be a computer or a simpler piece of hardware connected to a system. An <b>execution environment</b> is software that itself hosts or contains other software, examples are an operating system or a container process.</li>
<li>The nodes contains <b>artifacts</b>, which are the physical manifestations of software: usually, files. These files might be executables (such as .exe files, binary files, DLLs, JAR files, assemblies, or scripts), or data files, configuration files, HTML documents, and so on. Listing an artifact within a node shows that the artifact is deployed to that node in the running system.</li>
<li>You can show artifacts either as class boxes or by listing the name within a node.</li>
<li>Artifacts are often the implementation of a component. To show this, you can use a tagged value in the artifact box.</li>
<li>Communication paths between nodes indicate how things communicate. You can label these paths with information about the communication protocols that are used.</li>
</ul>
</div>
</div>
