UML/uml.org
* Use cases
- Use cases are a technique for capturing the functional requirements of a system. Use cases work by describing the typical interactions between the users a system and the system itself, providing a narrative of how the system is used.
- A *scenario* is a sequence of steps describing an interaction between an user and a system. So, if we a Web-based online store, we might have a Buy a Product scenario.
- A use case is a set of scenarios tied together by a common user goal. In use-case speak, the users are referred to as actors. An *actor* is a role that a user plays with respect to the system. Actors might include customer, customer service rep, sales manager, and product analyst. Actors carry out use cases.
  A single actor may perform many use cases; conversely, a use case may have several actors performing it. Usually, you have many customers, so many people can be the customer actor. Also, one person may act as more than one actor. An actor doesn't have to be human. If the system performs a service for another computer system, that other system is an actor.
- Each use case has a primary actor, which calls on the system to deliver a service. The primary actor is the actor with the goal the use case is trying to satisfy and is usually, but not always, the initiator of the use case. There may be other actors as well with which the system communicates while carrying out the use case. These are known as secondary actors.
- Each step in a use case is an element of the interaction between an actor and the system. Each step should be a simple Statement and should clearly show who is carrying out the step. The step should show the intent of the actor, not the mechanics of what the actor does. Consequently, you don't describe the user interface in the use case. Indeed, writing the use case usually precedes designing the user interface.
- An extension within the use case names a condition that results in different interactions from those described in the main success scenario (MSS) and states what chose differences are.
- The use case structure is a great way to brainstorm alternatives to the main success scenario. For each step, ask, how could this go differently? and in particular, what could go wrong? It's usually best to brainstorm all the extension conditions first, before you get bogged down working out the consequences.
- A complicated step in a use case can be another use case. In UML terms we say that the first use case *includes* the second. There's no standard way to show an included use case in the text, but I find that underlining, which suggests a hyperlink, works very nicely and in many tools really will be a hyperlink.
- Included use cases can be useful for a complex step that would clutter the main scenario or for steps that are repeated in several use cases. However, don't try to break down use cases into sub-use cases and subsub-use cases using functional decomposition. Such a decomposition is a good way to waste a lot of time.
- As well as the steps in the scenarios, you can add some other common information to a use case:
  + A *pre-condition* describes what the system should ensure is true before the system allows the use case to begin.
  + A *guarantee* describes what the system will ensure at the end of the use case. Success guarantees hold after a successful scenario; minimal guarantee hold after any scenario.
  + A *trigger* specifies the event that gets the use case started.
- Although the diagram is sometimes useful, it isn't mandatory. In your use case work, don't put too much effort into the diagram. Instead, concentrate an the textual content of the use cases.
- The use case diagram shows the actors, the use cases,  and the relationship between them:
  + which actor carry out which use cases
  + which use cases include other use cases
** Levels of Use Cases
- A common problem with use cases is that by focusing an the interaction between a user and the System, you can neglect situations in which a change to a business process may be the best way to deal with the problem.
- There are often two general terms. *System use cases* and *business use cases*. A system use case is an interaction with the *software*, where as a business use case discuss how a business respond to an event.
- Some people suggests a scheme of levels of use cases. The core use cases are at "sea level." *Sea-level* use cases typically represent a discrete interaction between a primary actor and the system. Use cases that are there only because they are included by sea-level use cases are *fish level*. Higher, *kite-level* use cases show how the sea-level use cases fit into wider business interactions. Kite-level use cases are usually business use cases, where as sea and fish levels are system use cases. You should have most of your use cases at the sea level. It's preferred to indicate the level at the top of the use case.
* State Machine Diagram
- State machine diagrams are techniques to describe the behavior of a system. In object-oriented approaches, you draw a state machine diagram for a single class to show the lifetime behavior of a single object.
- The *transition* indicates a movement from one state to another. Each transition has a label that comes in three parts: trigger-signature [guard]/activity. All the parts are optional. The *trigger-signature* is usually a single event that triggers a potential change of state. The *guard* , if present, is a Boolean condition that must be true for the transition to be taken. The *activity* is some behavior that's executed during the transition. It may be any behavioral expression.
- A missing activity indicates that you don't do anything during the transition. A missing guard indicates that you always take the transition if the event occurs. A missing trigger-signature is rare but does occur. It indicates that you take the transition immediately, which you see mostly with activity states.
- When an event occurs in a state, you can take only one transition out of it. So if you use multiple transitions with the same event, the *guards* must be mutually exclusive.
- Remember that state machines can show only what the object directly observes or activates.
** Internal Activities
- States can react to events without transition, using *internal activities:* putting the event, guard, and activity inside the state box itself.
** Superstates
- Often, you will find several states share common transitions and the internal activities. In these cases, you can make them substates and move the shared behavior into a superstate. 
** Concurrent state
- States can broken into several orthogonal state diagrams that run concurrently.
