UML/uml.html
<div id="outline-container-org8b4c714" class="outline-3">
<h3 id="org8b4c714"><span class="section-number-3">10.4.</span> Implementing State diagrams</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li>A state diagram can be implemented in three main ways: nested switch, the state pattern, and state tables. The most direct approach to handling a state diagram is a nested switch statement.</li>
<li>The <b>State pattern [Gang of Four]</b> creates a hierarchy of state classes to handle behavior of the states. Each state in the diagram has one state subclass. The controller has methods for each event, which simply forwards to the state class. The top of the hierarchy is an abstract class that implements all the event handling methods to do nothing. For each concrete state, you simply override the specific event methods for which that state has transitions.</li>
<li>The <b>state table</b> approach captures the state diagram information as data. We then build either an interpreter that uses the state table at runtime or a code generator that generates classes based on the state table.</li>
<li>These implementations are pretty minimal, but they should give you an idea of how to go about implementing state diagrams. In each case, implementing state models leads to very boilerplate code, so it's usually best to use some form of code generation to do it.</li>
</ul>
</div>
</div>
<div id="outline-container-org45baef2" class="outline-3">
<h3 id="org45baef2"><span class="section-number-3">10.5.</span> When to use state diagrams?</h3>
<div class="outline-text-3" id="text-10-5">
<ul class="org-ul">
<li>State diagrams are good at describing the behavior of an object across several use cases. State diagrams are not very good at describing behavior that involves a number of objects collaborating. As such, it is useful to combine state diagrams with other techniques. You should remember to use the mix of techniques that works for you.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org234afc1" class="outline-2">
<h2 id="org234afc1"><span class="section-number-2">11.</span> Activity Diagrams</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Activity diagrams are a technique to describe procedural logic, business process, and work flow. In many ways, they play a role similar to flowcharts, but the principal difference between them and flowchart notation is that they support parallel behavior.</li>
<li>The activity diagram allows whoever is doing the process to choose the order in which to do things. In other words, the diagram merely states the essential sequencing rules I have to follow. This is important for business modeling because process often occur in parallel. It's also useful for concurrent algorithm, in which independent threads can do things in parallel.</li>
<li>When you do have parallelism, you need to synchronize. And you can do this using <b>join</b> before closing the processes.</li>
<li>The nodes on activity diagrams are called <b>actions</b> not activities. Strictly, an activity refers to a sequence of actions, so the diagram shows an activity that is made up of actions.</li>
<li>Conditional behavior is delineated by decisions and merges. A <b>decision</b> has a single incoming flow and several guarded outbound flows. Each outbound flow has a guard: a Boolean condition placed inside square brackets. Each time you reach a decision, you can take only one of the outbound flows, so the guards should be mutually exclusive.</li>
<li>A <b>merge</b> has multiple input flows and a single output. A merge marks the end of conditional behavior started by a decision.</li>
</ul>
</div>
<div id="outline-container-orgb77a90c" class="outline-3">
<h3 id="orgb77a90c"><span class="section-number-3">11.1.</span> Decomposing actions</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>Actions can be decomposed into sub activities. Actions can be implemented either as subactivities or as methods on classes. You can show a subactivity by using the rake symbol. You can show a call on a method with syntax <b>class-name::method-name</b></li>
</ul>
</div>
</div>

<div id="outline-container-orgd4b464c" class="outline-3">
<h3 id="orgd4b464c"><span class="section-number-3">11.2.</span> Partition</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>Activity diagrams tell you what happens, but they do not tell you who does what. In programming, this means that the diagram does not convey which class is responsible for each action. In business process modeling, this does not convey which part of an organization carries out which action. This isn't necessarily a problem; often, it makes sense to concentrate an what gets done rather than an who does what parts of the behavior.</li>
<li>If you want to show who does what, you can divide an activity diagram into <b>partitions</b>, which shows which actions one class or organization unit carries out.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb573623" class="outline-3">
<h3 id="orgb573623"><span class="section-number-3">11.3.</span> Signals</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>Actions can respond to signals. A <b>time signal</b> occurs because of the passage of time. Such signals may indicate the end of a month in financial period or each micro second in a real-time controller.</li>
<li>A <b>signal</b> indicates that the activity receives an event from an outside process. This indicates that the activity constantly listens for those signals, and the diagram defines how the activity reacts.</li>
<li>As well as accepting signals, we can send them. This useful when we have to send a message and then wait for a reply before we can continue.</li>
</ul>
</div>
</div>
<div id="outline-container-org0c244ae" class="outline-3">
<h3 id="org0c244ae"><span class="section-number-3">11.4.</span> Tokens</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li>If you're sufficiently brave to venture into the demonic depths of the UML specification, you'll find that the activity section of the specification talks a lot about tokens and their production and consumption. The initial node creates a token, which then passes to the next action, which executes and then passes the token to the next. At a fork, one token comes in, and the fork produces a token on each of its outward flows. Conversely, on a join, as each inbound token arrives, nothing happens until all the tokens appear at the join; then a token is produced on the outward flow.</li>
</ul>
</div>
</div>
<div id="outline-container-orge2209a0" class="outline-3">
<h3 id="orge2209a0"><span class="section-number-3">11.5.</span> Flows and Edges</h3>
<div class="outline-text-3" id="text-11-5">
<ul class="org-ul">
<li>UML 2 uses the term <b>flow</b> and <b>edge</b> synonymously to describe the connections between the two actions. The simplest kind of edge is the simple arrow between two actions. You can give a name to an edge if you like, but most of the time, a simple arrow will suffice.</li>
</ul>
</div>
</div>
<div id="outline-container-orge4c4707" class="outline-3">
<h3 id="orge4c4707"><span class="section-number-3">11.6.</span> Pins and Transformations</h3>
<div class="outline-text-3" id="text-11-6">
<ul class="org-ul">
<li>Actions can have parameters, just as methods do. You don't need to show information about parameters on activity diagram, but if you wish you can show them with <b>pins</b>. If you're decomposing an action, pins correspond to the parameter boxes on the decomposed diagram.</li>
<li>When you are drawing an activity diagram strictly, you have to ensure that the output parameters of an outbound action match the input parameter of another. If they don't match, you can indicate a <b>transformation</b> to get from one to another. The transformation must be an expression that's free of side effects: essentially, a query an the output pin quary that supplies an object of the right type for the input pin.</li>
<li>You don't have to show pins an an activity diagram. Pins are best when you want to look at the data needed and produced by the various actions. In business process modeling, you can use pins to show the resources produced and consumed by actions.</li>
<li>If you use pins, it's safe to show multiple flows coming into the same action. The pin notation reinforces the implicit join.</li>
</ul>
</div>
</div>
<div id="outline-container-org467c0ef" class="outline-3">
<h3 id="org467c0ef"><span class="section-number-3">11.7.</span> Expansion regions</h3>
<div class="outline-text-3" id="text-11-7">
<ul class="org-ul">
<li>With activity diagrams, you often run into situations in which one action's output triggers multiple invocations of another action. There are several ways to show this, but the best way is to use an expansion region. An <b>expansion region</b> marks an activity diagram area where actions occur once for each item in a collection.</li>
</ul>
</div>
</div>
