UML/uml.html
<div id="outline-container-org25368a1" class="outline-3">
<h3 id="org25368a1"><span class="section-number-3">11.8.</span> Flow Final</h3>
<div class="outline-text-3" id="text-11-8">
<ul class="org-ul">
<li>Once you get multiple tokens, as in an expansion region, you often get flows that stop even when the activity as a whole doesn't end. A <b>flow final</b> indicates the end of one particular flow, without terminating the whole activity. This approach allows expansion regions to act as filters, whereby the output collection is smaller than the input collection.</li>
</ul>
</div>
</div>
<div id="outline-container-org35bf71e" class="outline-3">
<h3 id="org35bf71e"><span class="section-number-3">11.9.</span> Join Specifications</h3>
<div class="outline-text-3" id="text-11-9">
<ul class="org-ul">
<li>By default, a join lets execution pass on its outward flow when all its input flows have arrived at the join.(Or in a more formal speak, it emits a token on its output flow when a token has arrived on each input flow). In some cases, particularly when you have a flow with multiple tokens, it's useful to have a more involved rule.</li>
<li>A <b>join specification</b> is a Boolean expression attached to a join. Each time a token arrives at the join, the join specification is evaluated and if true, an output token is emitted.</li>
</ul>
</div>
</div>
<div id="outline-container-orge09a493" class="outline-3">
<h3 id="orge09a493"><span class="section-number-3">11.10.</span> When to use Activity diagram?</h3>
<div class="outline-text-3" id="text-11-10">
<ul class="org-ul">
<li>The great strength of activity diagrams lies in the fact that they support and encourage parallel behavior. This makes them a great tool for work flow and process modeling.</li>
<li>The main strength of doing this may come with people using UML as a programming language. In this case, activity diagrams represent an important technique to represent behavioral logic.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org737c97f" class="outline-2">
<h2 id="org737c97f"><span class="section-number-2">12.</span> Communication Diagrams</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>Communication diagrams, a kind of interaction diagram, emphasize the data links between the various participants in the interaction. Instead of drawing each participant as a lifeline and showing the sequence of messages by vertical direction as the sequence diagrams does, the communication diagram allows free placement of participants, allows you to draw links to show how the participants connect, and use numbering to show the sequence of messages.</li>
<li>With communication diagram, we can show how the participants are linked together.</li>
<li>We can symbolize them using ball-and-socket notation.</li>
</ul>
</div>
<div id="outline-container-org9c9274a" class="outline-3">
<h3 id="org9c9274a"><span class="section-number-3">12.1.</span> When to use communication diagrams?</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>A more rational approach says that sequence diagrams are better when you want to emphasize the sequence of calls and that communication diagram are better when you want to emphasize the links.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org11a13f9" class="outline-2">
<h2 id="org11a13f9"><span class="section-number-2">13.</span> Composite Structures</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>One of the most significant new features in UML 2 is the ability to hierarchically decompose a class into an internal structure. This allows you to take a complex object and break it down into parts.</li>
</ul>
</div>
<div id="outline-container-org1c9df82" class="outline-3">
<h3 id="org1c9df82"><span class="section-number-3">13.1.</span> When to use composite structures?</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>A good way of thinking about the difference between packages and composite structures is that packages are compile-time grouping, while composite structure show runtime grouping. As such, there are natural fit for showing components and how they are broken into parts; hence, much of this notation is used in component diagrams.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb9f729b" class="outline-2">
<h2 id="orgb9f729b"><span class="section-number-2">14.</span> Component Diagrams</h2>
</div>
<div id="outline-container-orgbdb6ffb" class="outline-2">
<h2 id="orgbdb6ffb"><span class="section-number-2">15.</span> Timing Diagrams</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>Timing diagrams are another form of interaction diagrams, where the focus is on timing constraints: either for a single object or, more usefully a bunch of objects. Timing diagrams are useful for showing timing constraints between state changes an different objects.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ertale81</p>
<p class="date">Created: 2025-06-07 Sat 22:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
